IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WS-NUMBER PIC 9(02).
        01 WS-REMAIN PIC 9(02).
        01 WS-QUO    PIC 9(02).
PROCEDURE DIVISION.
    display "enter a number: " 
    accept WS-NUMBER
    DIVIDE WS-NUMBER BY 2 GIVING WS-QUO REMAINDER WS-REMAIN
    display "remain: " WS-REMAIN
    IF WS-REMAIN = ZERO 
        DISPLAY 'EVEN-' WS-NUMBER
    ELSE 
        DISPLAY 'ODD- ' WS-NUMBER
STOP RUN.
