000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. EVEODD.
000000 ENVIRONMENT DIVISION.
000000 DATA DIVISION.
000000 WORKING STORAGE SECTION.
000000   01 WS-NUMBER PIC 9(02).
000000   01 WS-REMAINDER PIC 9(02).
000000 PROCEDURE DIVISION.
000000 DISPLAY " WELCOME EVEN ODD PROGRAMME"
000000 DISPLAY "ENTER A NUMBER TO KNOW EVEN/ODD."
000000 ACCEPT WS-NUMBER
000000 DIVIDE WS-NUMEBR BY 2 GIVING REMAINDER WS-REMAINDER
000000 IF WS-REMAINDER = ZEROES
000000   DISPLAY "NUMBER IS EVEN: " WS-NUMBER
000000 ELSE 
000000   DISPLAY "NUMBER IS ODD: " WS-NUMBER
000000 END-IF.
000000   STOP RUN.
