000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. HELLO_COBOL.      
000000 ENVIRONMENT DIVISION.
000000 DATA DIVISION.
000000 PROCEDURE DIVISION.
000000   DISPLAY "hello cobol".
000000   STOP RUN.
